---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallBottomIsAttached
source: html/206586fc-e5d7-3746-324c-121bb82f9f99.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallBottomIsAttached Property

"Base is Attached"

## Syntax (C#)
```csharp
public static ForgeTypeId WallBottomIsAttached { get; }
```